/*
	File:		SlicesStrings.strings

	Contains:
	Copyright:	© 2007-2009 by Apple Inc., all rights reserved.
*/

//===========================================================================
// NOTE FOR LOCALIZERS:
// For any attributes overridden using the MDSlicesAttributeNameOverrides
// strings file, special care must be taken here. The KEY of the strings
// here will change from its english version to the name override.  For example:
//
// If MDSlicesAttributeNameOverrides.strings contains:
//		kMDItemTextContent = "TEXTCONTENT";
//
// Then replace any use of "Contents" (the english localization) in the KEYS
// of this file with the localization provided in MDSlicesAttributeNameOverrides.strings.
//
// In the above example, the localizer should change the text content localization below from:
//		"%[Contents]@ contains %@" = "%1$[Contents]@ contains %2$@";  // english version
//	to:
//		"%[TEXTCONTENT]@ contains %@" = "%1$[TEXTCONTENT]@ xxxxxx %2$@"; // localized version
//===========================================================================

/* Compound-type slices */
"%[Any]@ of the following are true" = "%1$[Algumas]@ destas se verificam";
"%[All]@ of the following are true" = "%1$[Todas]@ estas se verificam";
"%[None]@ of the following are true" = "%1$[Nenhuma]@ destas se verifica";

/* Specific kind strings */
"%[Kind]@ is %[any]@" = "%1$[Tipo]@ é %2$[qualquer]@";
"%[Kind]@ is %[applications]@" = "%1$[Tipo]@ is %2$[aplicação]@";
"%[Kind]@ is %[documents]@" = "%1$[Tipo]@ é %2$[documento]@";
"%[Kind]@ is %[folders]@" = "%1$[Tipo]@ é %2$[pasta]@";
"%[Kind]@ is %[images]@ %[all]@" = "%1$[Tipo]@ é %2$[imagem]@ %3$[tudo]@";
"%[Kind]@ is %[images]@ %[JPEG]@" = "%1$[Tipo]@ é %2$[imagem]@ %3$[JPEG]@";
"%[Kind]@ is %[images]@ %[TIFF]@" = "%1$[Tipo]@ é %2$[imagem]@ %3$[TIFF]@";
"%[Kind]@ is %[images]@ %[GIF]@" = "%1$[Tipo]@ é %2$[imagem]@ %3$[GIF]@";
"%[Kind]@ is %[images]@ %[PNG]@" = "%1$[Tipo]@ é %2$[imagem]@ %3$[PNG]@";
"%[Kind]@ is %[images]@ %[BMP]@" = "%1$[Tipo]@ é %2$[imagem]@ %3$[BMP]@";
"%[Kind]@ is %[music]@ %[all]@" = "%1$[Tipo]@ é %2$[música]@ %3$[tudo]@";
"%[Kind]@ is %[music]@ %[MP3]@" = "%1$[Tipo]@ é %2$[música]@ %3$[MP3]@";
"%[Kind]@ is %[music]@ %[AAC]@" = "%1$[Tipo]@ é %2$[música]@ %3$[AAC]@";
"%[Kind]@ is %[music]@ %[purchased]@" = "%1$[Tipo]@ é %2$[música]@ %3$[comprada]@";
"%[Kind]@ is %[PDF]@" = "%1$[Tipo]@ é %2$[PDF]@";
"%[Kind]@ is %[presentations]@" = "%1$[Tipo]@ é %2$[apresentação]@";
"%[Kind]@ is %[text]@ %[all]@" = "%1$[Tipo]@ é %2$[texto]@ %3$[tudo]@";
"%[Kind]@ is %[text]@ %[plain text]@" = "%1$[Tipo]@ é %2$[texto]@ %3$[texto normal]@";
"%[Kind]@ is %[text]@ %[rich text]@" = "%1$[Tipo]@ é %2$[texto]@ %3$[texto formatado]@";
"%[Kind]@ is %[text]@ %[HTML]@" = "%1$[Tipo]@ é %2$[texto]@ %3$[HTML]@";
"%[Kind]@ is %[text]@ %[XML]@" = "%1$[Tipo]@ é %2$[texto]@ %3$[XML]@";
"%[Kind]@ is %[text]@ %[source code]@" = "%1$[Tipo]@ é %2$[texto]@ %3$[código fonte]@";
"%[Kind]@ is %[movies]@" = "%1$[Tipo]@ é %2$[filme]@";
"%[Kind]@ is %[other]@ %@" = "%1$[Tipo]@ é %2$[outro]@ %3$@";

/* date-type attribute template, like kMDItemContentCreationDate */
"%@ is %[within last]@ %@ %[days]@" = "%1$@ é %2$[nos últimos]@ %3$@ %4$[dias]@";
"%@ is %[within last]@ %@ %[weeks]@" = "%1$@ é %2$[nas últimas]@ %3$@ %4$[semanas]@";
"%@ is %[within last]@ %@ %[months]@" = "%1$@ é %2$[nos últimos]@ %3$@ %4$[meses]@";
"%@ is %[within last]@ %@ %[years]@" = "%1$@ é %2$[nos últimos]@ %3$@ %4$[anos]@";
"%@ is %[exactly]@ %@" = "%1$@ é %2$[exactamente]@ %3$@";
"%@ is %[before]@ %@" = "%1$@ é %2$[anterior a]@ %3$@";
"%@ is %[after]@ %@" = "%1$@ é %2$[posterior a]@ %3$@";
"%@ is %[today]@" = "%1$@ é %2$[hoje]@";
"%@ is %[yesterday]@" = "%1$@ é %2$[ontem]@";
"%@ is %[this week]@" = "%1$@ é %2$[esta semana]@";
"%@ is %[this month]@" = "%1$@ é %2$[este mês]@";
"%@ is %[this year]@" = "%1$@ é %2$[este ano]@";

/* string-type attribute, like kMDItemDisplayName */
"%@ %[contains]@ %@" = "%1$@ %2$[contém]@ %3$@";
"%@ %[begins with]@ %@" = "%1$@ %2$[começa por]@ %3$@";
"%@ %[ends with]@ %@" = "%1$@ %2$[acaba em]@ %3$@";
"%@ %[is]@ %@" = "%1$@ %2$[é]@ %3$@";
"%@ %[matches]@ %@" = "%1$@ %2$[coincide com]@ %3$@";

/* boolean-type attribute, like kMDItemFlashOnOff */
"%@ %[any]@" = "%1$@ %2$[Qualquer]@";
"%@ %[yes]@" = "%1$@ %2$[Sim]@";
"%@ %[no]@" = "%1$@ %2$[Não]@";

/* file visibility */
"%[File invisible]@ %[visible items]@" = "%1$[Visibilidade do ficheiro]@ %2$[elementos visíveis]@";
"%[File invisible]@ %[invisible items]@" = "%1$[Visibilidade do ficheiro]@ %2$[elementos invisíveis]@";
"%[File invisible]@ %[visible or invisible]@" = "%1$[Visibilidade do ficheiro]@ %2$[visível ou invisível]@";

/* raw query slice */
"%[Raw query]@ %@" = "%1$[Consulta básica]@ %2$@";

/* file extension slice */
"%[File Extension]@ %[is]@ %@" = "%1$[Extensão do ficheiro]@ %2$[é]@ %3$@";

/* number-type attribute, like kMDItemAudioChannelCount */
"%@ %[equals]@ %@" = "%1$@ %2$[equivale a]@ %3$@";
"%@ %[is greater than]@ %@" = "%1$@ %2$[é maior que]@ %3$@";
"%@ %[is less than]@ %@" = "%1$@ %2$[é menor que]@ %3$@";
"%@ %[is not]@ %@" = "%1$@ %2$[não é]@ %3$@";

/* text contents */
"%@ contains %@" = "%1$@ contém %2$@";

/* Byte-sized attributes, such as kMDItemFSSize */
"%@ %[equals]@ %@ %[KB]@" = "%1$@ %2$[equivale a]@ %3$@ %4$[KB]@";
"%@ %[equals]@ %@ %[MB]@" = "%1$@ %2$[equivale a]@ %3$@ %4$[MB]@";
"%@ %[equals]@ %@ %[GB]@" = "%1$@ %2$[equivale a]@ %3$@ %4$[GB]@";
"%@ %[is less than]@ %@ %[KB]@" = "%1$@ %2$[é menor que]@ %3$@ %4$[KB]@";
"%@ %[is less than]@ %@ %[MB]@" = "%1$@ %2$[é menor que]@ %3$@ %4$[MB]@";
"%@ %[is less than]@ %@ %[GB]@" = "%1$@ %2$[é menor que]@ %3$@ %4$[GB]@";
"%@ %[is greater than]@ %@ %[KB]@" = "%1$@ %2$[é maior que]@ %3$@ %4$[KB]@";
"%@ %[is greater than]@ %@ %[MB]@" = "%1$@ %2$[é maior que]@ %3$@ %4$[MB]@";
"%@ %[is greater than]@ %@ %[GB]@" = "%1$@ %2$[é maior que]@ %3$@ %4$[GB]@";
"%@ %[is not]@ %@ %[KB]@" = "%1$@ %2$[não é]@ %3$@ %4$[KB]@";
"%@ %[is not]@ %@ %[MB]@" = "%1$@ %2$[não é]@ %3$@ %4$[MB]@";
"%@ %[is not]@ %@ %[GB]@" = "%1$@ %2$[não é]@ %3$@ %4$[GB]@";

/* Duration-type attributes, such as kMDItemDurationSeconds */
"%@ %[equals]@ %@ hours %@ minutes %@ seconds" = "%1$@ %2$[equivale a]@ %3$@ horas %4$@ minutos %5$@ segundos";
"%@ %[is less than]@ %@ hours %@ minutes %@ seconds" = "%1$@ %2$[é menor que]@ %3$@ horas %4$@ minutos %5$@ segundos";
"%@ %[is greater than]@ %@ hours %@ minutes %@ seconds" = "%1$@ %2$[é maior que]@ %3$@ horas %4$@ minutos %5$@ segundos";
"%@ %[is not]@ %@ hours %@ minutes %@ seconds" = "%1$@ %2$[não é]@ %3$@ horas %4$@ minutos %5$@ segundos";

/* This is for the slice that is added when a search string is present in the search field when saving a search. */
"%[Items matching text]@ %@" = "%1$[Elementos coincidem com texto]@ %2$@";

/* Search System Files slice */
"%[SEARCH_SYSTEM_FILES]@ %[YES]@" = "%1$[Ficheiros do sistema]@ %2$[incluídos]@";
"%[SEARCH_SYSTEM_FILES]@ %[NO]@" = "%1$[Ficheiros do sistema]@ %2$[não incluídos]@";

/* Spotlight items slice */
"%[SEARCH_SPOTLIGHT_ITEMS]@ %[YES]@" = "%1$[Elementos do Spotlight]@ %2$[incluídos]@";
"%[SEARCH_SPOTLIGHT_ITEMS]@ %[NO]@" = "%1$[Elementos do Spotlight]@ %2$[não incluídos]@";

